"""
    1. Если в строке буква 's' встречается один раз, вывести ее индекс,
    если 2 и более - вывести индекс ее первого и последнего вхождения.

    Для теста:
    'expressions'
    'string'
    'python'
"""

s = "expressions"


"""
    2. Переставить слова местами.
    Возвести первую букву получившейся строки в верхний регистр,
    все остальный в нижний.

    Без циклов и условий.

    Для теста:
    'Hello world'  'World hello'
    'Basic python course'  'Course python basic'
"""


"""
    3. В строке заменить цифры словами
    0 - zero
    1 - one
    2 - two
    3 - three
    4 - four

    Для теста:
    '2 + 2 = 4'
    '1,2,3,4,5'
    'He11o W0rld'
"""


"""
    4. Удалить из строки все запятые.
"""

s = "Secure, shy, favour length, all twenty, denote."
