"""
    Необходимо реализовать форму регистрации пользователей.
    Поля формы: номер телефона, email, пароль и подтверждение пароля.

    пункты с ** - дополнительно, но не обязательно (не влияет на оценку)

    1. Пользователь вводит номер телефона.
        Программа проверяет валидность телефона:
        - приводит номер к формату 380501234567
        - если номер не получается привести к нужному формату
            то запрашивает ввод номера еще раз
            и так до тех пор, пока не будет введен валидный номер

    2. Пользователь вводит email.
        Программа проверяет валидность email:
        - должен иметь длину 6 символов и больше
            (функция len())
        - содержать один символ '@'
            (строчный метод count())
        - ** содержать логин и полный домен (логин@полный.домен)
        Пользователь может вводить email до тех пор, пока он не будет валидным.

    3. Пользователь ввод пароль.
        Программа проверяет надежность пароля:
        - минимум 8 символов
            (функция len())
        - пароль не должен содержать пробельные символы
            (строчный метод isspace())
        - наличие минимум 1 буквы в верхнем регистре, 1 в нижнем и 1 цифры
            (строчные методы isupper(), islower(), isdigit())
        - ** наличие минимум 1 спец символа

    4. После успешного ввода пароля пользователь вводит подтверждение пароля.
        Если подтверждение пароля не сходится с введенным паролем,
        то возвращаемся к пункту 3.

    Программа выводит сообщение:

    Поздравляем с успешной регистрацией!
    Ваш номер телефона: +380501234567
    Ваш email: example@mail.com
    Ваш пароль: ********** (кол-во  == кол-ву символов пароля)

"""
import re


def main():
    phone = get_phone()
    email = get_email()
    password = get_password()

    print(
        f"\nПоздравляем с успешной регистрацией!"
        f"\nВаш номер телефона: +{phone}"
        f"\nВаш email: {email}"
        f'\nВаш пароль: {"*"*len(password)}'
    )


def get_phone():
    phone = input("Введите номер телефона: ")
    phone = re.sub(r"\D", "", phone)
    return "380" + phone[-9:] if len(phone) > 8 else get_phone()


# 2 вариант функции получения номера телефона
# def get_phone():
#     phone = input("Enter phone number:")
#     a = "".join(s for s in phone if s.isdigit())
#     phone = "+38" + a[-10:]

#     if len(phone) != 13:
#         print('Wrong format. Try again.')
#         return get_phone()
#     return phone


def get_email():
    email = input("Введите email: ")
    if len(email) < 6 or email.count("@") != 1 or email.startswith("@"):
        print("Неверный формат. Повторите ввод.")
        return get_email()
    return email


# 2 вариант функции получения email (с регулярными выражениями)
# def get_email(message='Введите email: '):
#     email = input(message)

#     if not re.search(r'^[\w]+[\w.-]*@[\w.-]+\.[a-zA-Z]{2,}$', email):
#         return get_email('Неверный формат email. Повторите ввод: ')
#     return email


def get_password():
    password = input("Введите пароль: ")
    if len(password) < 8 or re.findall(r"\s", password):
        print("Пароль слишком простой. Придумайте более надежный пароль.")
        return get_password()

    u_counter = l_counter = d_counter = s_counter = 0
    for i in password:
        if i.isupper():
            u_counter += 1
        elif i.islower():
            l_counter += 1
        elif i.isdigit():
            d_counter += 1
        else:
            s_counter += 1

    if min(u_counter, l_counter, d_counter, s_counter) == 0:
        print("Пароль слишком простой. Придумайте более надежный пароль.")
        return get_password()

    if input("Повторите пароль: ") != password:
        print("Пароли не совпадают.")
        return get_password()
    return password


if __name__ == "__main__":
    main()
